Repository: noiia/A3_FISA_GENIE_LOGICIEL
Catalog: Job/Config/i18n/Resources/Resources.*.resx
Languages: fr

# CallWithArgs
source: is call with args :
fr: est appelé avec les arguments :

# SjCreatedSuccesfully
source: Save Job has been created
fr: Le nouveau travail de sauvegarde a été sauvegardé

# AddSjBadArgs
source: Bad arguments, require Add-Savejob <name> <source> <destination> <type>
fr: Mauvais arguments, Add-Savejob <nom> <source> <destination> <type>

# SaveAlreadyExist
source: A save Job already exist with this name
fr: Un travail de sauvegarde existe déjà sous ce nom

# SrcDirNotExists
source: Source directory does not exist
fr: Le répertoire source n'existe pas

# DstDirNotExist
source: Destination directory does not exist
fr: Le répertoire destination n'existe pas

source: Invalid type :
fr: Type indisponible :

# AddSJBadType
source: real type are full | diff
fr: les types possibles sont : full, diff

# DelSjCallWithArgs
source: Delete-SaveJob : is call with args :
fr: Delete-SaveJob : est appelé avec les arguments :

# IdShouldBeANumber
source: The id should be a number
fr: L'id doit être un nombre

# SjDelSuccesfully
source: Save Jobs deleted :
fr: Travaux de sauvegarde supprimés :

# DelSjBadArgs
source: Bad arguments, require Delete-SaveJob <id>
fr: Mauvais arguments fournis, la commande se formule comme suivant : Delete-SaveJob <id>

# SjNotExist
source: Save Job does not exist (
fr: Le travail demandé n'existe pas (

# SjExecWith
source: Exec-SaveJob : is call with args :
fr: Exec-SaveJob : est appelé avec les arguments de commande :

# SjExecSuccesfully
source: Save Job done successfully
fr: Le travail de sauvegarde s'est déroulé sans encombre

# ExecSjBadArgs
source: Bad arguments, require Exec-Savejob <id>|<name> or <id>;<id>;<id> or <id>,<id>
fr: Mauvais arguments, la commande nécessite Exec-Savejob <id>|<nom> ou <id>;<id>;<id> ou <id>,<id>

# ListSjCallWith
source: List-SaveJob : is call with args :
fr: List-SaveJob : est appelé avec les arguments :

# NoSjToPrint
source: There is no SaveJob to print
fr: Il n'y a aucun travail de sauvegarde à imprimer

source: Name
fr: Nom

source: Last save :
fr: Dernière sauvegarde :

source: Created :
fr: Créé le :

# SetLogPathCallWith
source: Set-LogPath : is call with args :
fr: Set-LogPath : est appelé avec les arguments :

# LogPathUpdatedSuccesfully
source: LogPath has been updated :
fr: LogPath a été mis à jour :

# NotValidPath
source: is not a valid path
fr: n'est pas un chemin valide

# LogPathBadArgs
source: Bad arguments, require Set-LogPath <logPath>
fr: Mauvais arguments, la commande nécessite Set-LogPath <logPath>

# LanguageChanged
source: Language changed to :
fr: Langue modifiée au profit de la nouvelle langue :

# LanguageNotSupported
source: this language is not supported, require en or fr
fr: n'est pas un language supporté par le système

# LanguageBadArgs
source: Bad arguments, require en or fr :
fr: Mauvais arguments fournis :

# BadArgsGiven
source: Bad arguments given :
fr: Mauvais arguments donnés :

# SeparatorNotReco
source: Separator not recognized :
fr: Les séparateurs sont inconnus du système :

# TooMuchIdWithoutSep
source: Too much id given without separator :
fr: Trop d'identifiants ont été passés sans bénéficier de séparateurs :

# MissingArgs
source: Missing arguments :
fr: Arguments manquants :

# SettingsTitle
source: Settings
fr: Paramètres

# SelectLanguageTitle
source: Select Language
fr: Sélectionner la langue

# SelectLanguagePlaceholder
source: Select Language
fr: Sélectionner la langue

# SelectLogTypeTitle
source: Select Log Type
fr: Sélectionner le type de log

# SelectLogTypePlaceholder
source: Select Log Type
fr: Sélectionner le type de log

# SetLogPathTitle
source: Set Log Path
fr: Définir le chemin du log

# SetLogPathWatermark
source: Set Log Path
fr: Définir le chemin du log

# BrowseButton
source: Browse...
fr: Parcourir...

# ResetButton
source: Reset
fr: Réinitialiser

# FileTypesToEncryptTitle
source: File Types to Encrypt
fr: Types de fichiers à chiffrer

# AddFileTypeWatermark
source: Add File Type
fr: Ajouter un type de fichier

# AddButton
source: Add
fr: Ajouter

# RemoveSelectedButton
source: Remove Selected
fr: Supprimer la sélection

# BusinessAppBlockingTitle
source: Business Applications Blocking SJ
fr: Applications métiers bloquant SJ

# AddBusinessAppWatermark
source: Add Business App
fr: Ajouter une application métier

# SetEncryptionKeyTitle
source: Set Encryption Key
fr: Définir la clé de chiffrement

# EnterEncryptionKeyWatermark
source: Enter Encryption Key
fr: Entrer la clé de chiffrement

# UpdateKeyButton
source: Update Key
fr: Mettre à jour la clé

source: Confirm
fr: Confirmer

source: Full
fr: Complet

source: Select Save Type
fr: Sélectionner le type de sauvegarde

source: Differential
fr: Différentielle

# SrcPath
source: Source path
fr: Dossier source

# DestPath
source: Destination path
fr: Dossier de destination

source: Last Execution
fr: Dernière exécution

source: Execute
fr: Exécuter

source: Delete
fr: Supprimer

source: Select
fr: Sélectionner

source: Creation
fr: Création

source: Edit
fr: Editer

# BusinessAppLock
source: Business app running, execution locked
fr: Application métier en cours d'exécution, impossible de lancer un travail de sauvegarde
